app/Controllers/Admin.php

SELECT `users`.`id` as `userid`, `username`, `email`, `nama_lengkap`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `auth_groups`.`name` = 'user'
---
    public function index()
    {
        $this->builder->select('users.id as userid, username, email, nama_lengkap, name');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id ');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id ');
        $this->builder->where('auth_groups.name', 'user');
        $query = $this->builder->get();

SELECT `users`.`id` as `userid`, `username`, `email`, `nama_lengkap`, `nomor_hp`, `created_at`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `users`.`id` = '3'
---
    public function detail_user($id)
    {
        $this->builder->select('users.id as userid, username, email, nama_lengkap, nomor_hp, created_at, name');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id ');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id ');
        $this->builder->where('users.id', $id);
        $query = $this->builder->get();