app/Controllers/User.php

INSERT INTO `transaksi` (`id_user`, `id_paket`, `tanggal_booking`, `tanggal_checkout`, `total`, `status`) VALUES ('2', '10', '2024-01-10T12:30', '2024-01-10T16:30', 160000, 'Menunggu Pembayaran')
---

        // Simpan transaksi
        $transaksiModel = new TransaksiModel();
        $transaksiModel->save($dataTransaksi);