app/Models/LayananModel.php

    public function getLayanan()
    {
        return $this->findAll();
---
SELECT *
FROM `layanan`