app/Models/PaketModel.php

SELECT `id_paket`
FROM `paket`
WHERE `id_layanan` = '4'
AND `id_ruangan` = '10'
 LIMIT 1
---
    public function getIdPaket($idLayanan, $idRuangan)
    {
        $paket = $this->select('id_paket')
            ->where('id_layanan', $idLayanan)
            ->where('id_ruangan', $idRuangan)
            ->first();