app/Models/RuanganModel.php

    public function getRuangan()
    {
        return $this->findAll();
---
SELECT *
FROM `ruangan`

    public function getKetersediaanRuangan($layananId)
    {
        return $this->select('ruangan.id_ruangan, ruangan.nomor_ruangan')
            ->join('paket', 'ruangan.id_ruangan = paket.id_ruangan')
            ->where('paket.id_layanan', $layananId)
            ->where('ruangan.status', 'kosong')
            ->findAll();
---
SELECT `ruangan`.`id_ruangan`, `ruangan`.`nomor_ruangan`
FROM `ruangan`
JOIN `paket` ON `ruangan`.`id_ruangan` = `paket`.`id_ruangan`
WHERE `paket`.`id_layanan` = '4'
AND `ruangan`.`status` = 'kosong'

    public function updateStatusRuangan($idRuangan, $status)
    {
        $this->where('id_ruangan', $idRuangan)
            ->set('status', $status)
            ->update();
---
UPDATE `ruangan` SET `status` = 'dipesan'
WHERE `id_ruangan` = '10'