app/Models/TransaksiModel.php

SELECT `transaksi`.`id_transaksi`, `layanan`.`nama_layanan`, `ruangan`.`nomor_ruangan`, `transaksi`.`tanggal_booking`, `transaksi`.`tanggal_checkout`, `transaksi`.`total`, `transaksi`.`status`
FROM `transaksi`
JOIN `paket` ON `transaksi`.`id_paket` = `paket`.`id_paket`
JOIN `layanan` ON `paket`.`id_layanan` = `layanan`.`id_layanan`
JOIN `ruangan` ON `paket`.`id_ruangan` = `ruangan`.`id_ruangan`
WHERE `transaksi`.`id_user` = '2'
---
    public function getTransaksiByUserId($userId)
    {
        return $this->select('transaksi.id_transaksi, layanan.nama_layanan, ruangan.nomor_ruangan, transaksi.tanggal_booking, transaksi.tanggal_checkout, transaksi.total, transaksi.status')
            ->join('paket', 'transaksi.id_paket = paket.id_paket')
            ->join('layanan', 'paket.id_layanan = layanan.id_layanan')
            ->join('ruangan', 'paket.id_ruangan = ruangan.id_ruangan')
            ->where('transaksi.id_user', $userId)
            ->findAll();

SELECT `layanan`.`nama_layanan`, `layanan`.`kelas_paket`, `ruangan`.`nomor_ruangan`, `paket`.`deskripsi`, `transaksi`.`tanggal_booking`, `transaksi`.`tanggal_checkout`, `transaksi`.`total`, `transaksi`.`status`, `users`.`username`
FROM `transaksi`
JOIN `paket` ON `transaksi`.`id_paket` = `paket`.`id_paket`
JOIN `layanan` ON `paket`.`id_layanan` = `layanan`.`id_layanan`
JOIN `ruangan` ON `paket`.`id_ruangan` = `ruangan`.`id_ruangan`
JOIN `users` ON `users`.`id` = `transaksi`.`id_user`
WHERE `transaksi`.`id_transaksi` = '7'
 LIMIT 1
---
    public function getDetailTransaksiById($idTransaksi)
    {
        return $this->select('layanan.nama_layanan, layanan.kelas_paket, ruangan.nomor_ruangan, paket.deskripsi, transaksi.tanggal_booking, transaksi.tanggal_checkout, transaksi.total, transaksi.status, users.username')
            ->join('paket', 'transaksi.id_paket = paket.id_paket')
            ->join('layanan', 'paket.id_layanan = layanan.id_layanan')
            ->join('ruangan', 'paket.id_ruangan = ruangan.id_ruangan')
            ->join('users', 'users.id = transaksi.id_user')
            ->where('transaksi.id_transaksi', $idTransaksi)
            ->first();